In [2]:
import pandas as pd

In [3]:
game = pd.read_csv('game.csv')
game.set_index('Unnamed: 0', inplace=True)

In [4]:
participants = pd.read_csv('participants.csv')

In [5]:
participants.set_index("Name", inplace=True)

In [6]:
participants.to_csv('participants.csv')

In [7]:
name = "ramen#7788"

In [8]:
participants

             Team
Name
ramen#4633  team1
ramen#7788  team2

In [9]:
participants.loc['ramen#4633', 'Team']

'team1'

In [28]:
teams = pd.read_csv('teams.csv')

In [30]:
teams

  TeamName      TeamCode
0  lololol  JYODKXEOSBOM
1      xyz  JILANMXSLMXY

In [12]:
var = input()

lol

In [13]:
teams

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0 TeamName      TeamCode
0             0           0.0         0.0       SA  VZBBLFNMYTMF
1             1           0.0         NaN    LOLOL  YUVMQJDVWKKU
2             0           NaN         NaN  Sahivam  SIJZJEVJLXEK

In [14]:
append = {'TeamName':[123], 'TeamCode':[113]}

In [15]:
append = pd.DataFrame(append)

In [16]:
teams = pd.concat((teams, append), axis=0)

In [17]:
teams

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0 TeamName      TeamCode
0           0.0           0.0         0.0       SA  VZBBLFNMYTMF
1           1.0           0.0         NaN    LOLOL  YUVMQJDVWKKU
2           0.0           NaN         NaN  Sahivam  SIJZJEVJLXEK
0           NaN           NaN         NaN      123           113

In [18]:
register = pd.read_csv('register.csv')

In [19]:
register

,Unnamed: 0,Name,Email,Roll Number,Phone Number,Discord Id,Team Name
0,0,Name,email@google.edu,1025,9821090000,discordid#4431,NaN

In [26]:
mask = register['Discord Id'] == 'discordid#4431'
register.loc[mask, 'Team Name'] = 'chut'

In [27]:
register

,Unnamed: 0,Name,Email,Roll Number,Phone Number,Discord Id,Team Name
0,0,Name,email@google.edu,1025,9821090000,discordid#4431,chut

In [51]:
game

,team1,team2,team3,team4,team5,team6,team7,team8,team9,team10
Unnamed: 0,,,,,,,,,,
team1,100,0,0,0,0,0,0,0,0,0
team2,0,100,0,0,0,0,0,0,0,0
team3,0,0,100,0,0,0,0,0,0,0
team4,10,0,0,100,0,0,0,0,0,0
team5,0,0,0,0,100,0,0,0,0,0
team6,0,0,0,0,0,100,0,0,0,0
team7,0,0,0,0,0,0,100,0,0,0
team8,0,0,0,0,0,0,0,100,0,0
team9,0,0,0,0,0,0,0,0,100,0
team10,0,0,0,0,0,0,0,0,0,100

In [50]:
game.loc[var, 'team1'] = 10